In [6]:
import pandas as pd
import numpy as np
import configparser

In [7]:
config = configparser.ConfigParser()
config.read('config.cfg')

['config.cfg']

In [30]:
config.get('PROYECTO', 'DB_HOST')

'db-proyecto-final-mysql.c12ocekyogj8.us-east-2.rds.amazonaws.com'

In [9]:
mysql_driver = f"""mysql+pymysql://{config.get('PROYECTO', 'DB_USERNAME')}:{config.get('PROYECTO', 'DB_PASSWORD')}@{config.get('PROYECTO', 'DB_HOST')}:{config.get('PROYECTO', 'DB_PORT')}/{config.get('PROYECTO', 'DB_NAME')}"""
mysql_driver

'mysql+pymysql://admin_mysql:Guatemala2024&$.@db-proyecto-final-mysql.c12ocekyogj8.us-east-2.rds.amazonaws.com:3306/db_proyecto_final'

### Cargamos Archivo airport.csv

In [10]:
airport_data = pd.read_csv('airports.csv')
airport_data.head()

,faa,name,lat,lon,alt,tz,dst,tzone
0,04G,Lansdowne Airport,41.130472,-80.619583,1044,-5,A,America/New_York
1,06A,Moton Field Municipal Airport,32.460572,-85.680028,264,-6,A,America/Chicago
2,06C,Schaumburg Regional,41.989341,-88.101243,801,-6,A,America/Chicago
3,06N,Randall Airport,41.431912,-74.391561,523,-5,A,America/New_York
4,09J,Jekyll Island Airport,31.074472,-81.427778,11,-5,A,America/New_York

In [17]:
airport_data.to_sql('airport', mysql_driver, index=False, if_exists = 'append')

1458

### Cargamos Archivo planes.csv

In [11]:
planes_data = pd.read_csv('planes.csv')
planes_data.head()

,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,N10156,2004.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan
1,N102UW,1998.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
2,N103US,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
3,N104UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
4,N10575,2002.0,Fixed wing multi engine,EMBRAER,EMB-145LR,2,55,NaN,Turbo-fan

In [13]:
planes_data.to_sql('planes', mysql_driver, index=False, if_exists = 'append')

4044

### Cargamos Archivo weather.csv

In [12]:
weather_data = pd.read_csv('weather.csv')
weather_data.head()

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,EWR,2013,1,1,1,39.02,26.06,59.37,270.0,10.35702,NaN,0.0,1012.0,10.0,2013-01-01T06:00:00Z
1,EWR,2013,1,1,2,39.02,26.96,61.63,250.0,8.05546,NaN,0.0,1012.3,10.0,2013-01-01T07:00:00Z
2,EWR,2013,1,1,3,39.02,28.04,64.43,240.0,11.50780,NaN,0.0,1012.5,10.0,2013-01-01T08:00:00Z
3,EWR,2013,1,1,4,39.92,28.04,62.21,250.0,12.65858,NaN,0.0,1012.2,10.0,2013-01-01T09:00:00Z
4,EWR,2013,1,1,5,39.02,28.04,64.43,260.0,12.65858,NaN,0.0,1011.9,10.0,2013-01-01T10:00:00Z

In [30]:
weather_data.to_sql('weather', mysql_driver, index=False, if_exists = 'append')

21558

### Cargamos Archivo airlines.csv

In [13]:
airlines_data = pd.read_csv('airlines.csv')
airlines_data.head()

  carrier                    name
0      9E       Endeavor Air Inc.
1      AA  American Airlines Inc.
2      AS    Alaska Airlines Inc.
3      B6         JetBlue Airways
4      DL    Delta Air Lines Inc.

In [47]:
airlines_data.to_sql('airlines', mysql_driver, index=False, if_exists = 'append')

16

In [14]:
sql_query = 'SELECT * FROM airlines;'
df_city = pd.read_sql(sql_query, mysql_driver)
df_city.head()

  carrier                    name
0      9E       Endeavor Air Inc.
1      AA  American Airlines Inc.
2      AS    Alaska Airlines Inc.
3      B6         JetBlue Airways
4      DL    Delta Air Lines Inc.

### Cargamos Archivo flights.csv

In [15]:
flights_data = pd.read_csv('flights.csv')
flights_data.head()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 05:00:00
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 05:00:00
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 06:00:00

In [32]:
flights_data.to_sql('flights', mysql_driver, index=False, if_exists = 'append')

336776

In [16]:
sql_airlines = 'SELECT * FROM airlines;'
df_airlines = pd.read_sql(sql_airlines, mysql_driver)
df_airlines.head()

  carrier                    name
0      9E       Endeavor Air Inc.
1      AA  American Airlines Inc.
2      AS    Alaska Airlines Inc.
3      B6         JetBlue Airways
4      DL    Delta Air Lines Inc.

In [21]:
sql_flights = 'SELECT * FROM flights;'
df_flights = pd.read_sql(sql_flights, mysql_driver)
df_flights.head()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,517,515,2,830,819,11,UA,1545,N14228,EWR,IAH,227,1400,5,15,2013-01-01 05:00:00
1,2013,1,1,533,529,4,850,830,20,UA,1714,N24211,LGA,IAH,227,1416,5,29,2013-01-01 05:00:00
2,2013,1,1,542,540,2,923,850,33,AA,1141,N619AA,JFK,MIA,160,1089,5,40,2013-01-01 05:00:00
3,2013,1,1,544,545,-1,1004,1022,-18,B6,725,N804JB,JFK,BQN,183,1576,5,45,2013-01-01 05:00:00
4,2013,1,1,554,600,-6,812,837,-25,DL,461,N668DN,LGA,ATL,116,762,6,0,2013-01-01 06:00:00

In [17]:
sql_airport = 'SELECT * FROM airport;'
df_airport = pd.read_sql(sql_airport, mysql_driver)
df_airport.head()

,faa,name,lat,lon,alt,tz,dst,tzone
0,04G,Lansdowne Airport,41.130472,-80.619583,1044,-5,A,America/New_York
1,06A,Moton Field Municipal Airport,32.460572,-85.680028,264,-6,A,America/Chicago
2,06C,Schaumburg Regional,41.989341,-88.101243,801,-6,A,America/Chicago
3,06N,Randall Airport,41.431912,-74.391561,523,-5,A,America/New_York
4,09J,Jekyll Island Airport,31.074472,-81.427778,11,-5,A,America/New_York

In [18]:
sql_planes = 'SELECT * FROM planes;'
df_planes = pd.read_sql(sql_planes, mysql_driver)
df_planes.head()

,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,,None,None,None,None,0,0,None,None
1,D942DN,None,None,None,None,0,0,None,None
2,N0EGMQ,None,None,None,None,0,0,None,None
3,N10156,2004,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,None,Turbo-fan
4,N102UW,1998,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,None,Turbo-fan

In [19]:
sql_weather = 'SELECT * FROM weather;'
df_weather = pd.read_sql(sql_weather, mysql_driver)
df_weather.head()

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,EWR,2013,1,1,1,39.02,26.06,59.37,270.0,10.35702,None,0.0,1012.0,10.0,2013-01-01T06:00:00Z
1,JFK,2013,1,1,1,39.02,26.06,59.37,260.0,12.65858,None,0.0,1012.6,10.0,2013-01-01T06:00:00Z
2,LGA,2013,1,1,1,39.92,26.06,57.33,260.0,13.80936,23.0156,0.0,1011.9,10.0,2013-01-01T06:00:00Z
3,EWR,2013,1,1,2,39.02,26.96,61.63,250.0,8.05546,None,0.0,1012.3,10.0,2013-01-01T07:00:00Z
4,JFK,2013,1,1,2,39.02,26.06,59.37,270.0,11.50780,None,0.0,1012.4,10.0,2013-01-01T07:00:00Z

In [37]:
flight_weather = pd.merge(df_weather, df_flights, on=["year","month","day","hour","origin"])
fact_airlines = pd.merge(flight_weather, df_airlines, on="carrier")
fact_airport = pd.merge(fact_airlines, df_airport, left_on="origin", right_on="faa")
data_final = pd.merge(fact_airport, df_planes, on="tailnum")

print(data_final)

       origin  year_x  month  day  hour   temp   dewp  humid  wind_dir  \
0         EWR    2013      1    1     5  39.02  28.04  64.43     260.0
1         EWR    2013      1    8    14   0.00   0.00   0.00       0.0
2         EWR    2013      1    9     7  33.98  30.02  85.24     260.0
3         EWR    2013      1    9    11   0.00   0.00   0.00       0.0
4         EWR    2013      1   13     8   0.00   0.00   0.00       0.0
...       ...     ...    ...  ...   ...    ...    ...    ...       ...
334259    JFK    2013     12   13     9   0.00   0.00   0.00       0.0
334260    JFK    2013     12   18     9   0.00   0.00   0.00       0.0
334261    JFK    2013     12   24     9   0.00   0.00   0.00       0.0
334262    JFK    2013     12   27     9   0.00   0.00   0.00       0.0
334263    JFK    2013     12   31     9   0.00   0.00   0.00       0.0

        wind_speed  ... dst             tzone  year_y  \
0         12.65858  ...   A  America/New_York    1999
1          0.00000  ...   A  America/New_York    1999
2          4.60312  ...   A  America/New_York    1999
3          0.00000  ...   A  America/New_York    1999
4          0.00000  ...   A  America/New_York    1999
...            ...  ...  ..               ...     ...
334259     0.00000  ...   A  America/New_York    2013
334260     0.00000  ...   A  America/New_York    2013
334261     0.00000  ...   A  America/New_York    2013
334262     0.00000  ...   A  America/New_York    2013
334263     0.00000  ...   A  America/New_York    2013

                           type manufacturer     model  engines seats speed  \
0       Fixed wing multi engine       BOEING   737-824        2   149  None
1       Fixed wing multi engine       BOEING   737-824        2   149  None
2       Fixed wing multi engine       BOEING   737-824        2   149  None
3       Fixed wing multi engine       BOEING   737-824        2   149  None
4       Fixed wing multi engine       BOEING   737-824        2   149  None
...                         ...          ...       ...      ...   ...   ...
334259  Fixed wing multi engine       AIRBUS  A330-243        2   377  None
334260  Fixed wing multi engine       AIRBUS  A330-243        2   377  None
334261  Fixed wing multi engine       AIRBUS  A330-243        2   377  None
334262  Fixed wing multi engine       AIRBUS  A330-243        2   377  None
334263  Fixed wing multi engine       AIRBUS  A330-243        2   377  None

           engine
0       Turbo-fan
1       Turbo-fan
2       Turbo-fan
3       Turbo-fan
4       Turbo-fan
...           ...
334259  Turbo-fan
334260  Turbo-fan
334261  Turbo-fan
334262  Turbo-fan
334263  Turbo-fan

[334264 rows x 46 columns]

# Preguntas

In [42]:
#Pas con mayor aterrizajes y el avin con mayor cantidad de vuelos

Pais_mayor_aterrizajes = (data_final.groupby("origin")
                          .size()  
                          .to_frame(name='conteo')  
                          .sort_values(by='conteo', ascending=False)
                          .reset_index()) 

pais_mas_aterrizajes = Pais_mayor_aterrizajes.head(1)['origin'].values[0]

print(f"El pas con la mayor cantidad de aterrizajes: {pais_mas_aterrizajes}")

El pas con la mayor cantidad de aterrizajes: EWR

In [48]:
#Avin con mas vuelos

agrupado = data_final.groupby("tailnum")["model"].size().sort_values(ascending=False)

print(agrupado)

tailnum
N725MQ    575
N722MQ    513
N723MQ    507
N711MQ    486
N713MQ    483
         ...
N569AS      1
N953DN      1
N871AS      1
N560AS      1
N451UW      1
Name: model, Length: 4043, dtype: int64

In [52]:
# Aeropuerto con la temperatura ms alta

indice_temp_max = data_final["temp"].idxmax()
origen_temp_max = data_final.loc[indice_temp_max, "origin"]

print(f"El origen con la temperatura ms alta: {origen_temp_max} con una temperatura de {indice_temp_max}.")

El origen con la temperatura ms alta: EWR con una temperatura de 3992.

In [72]:
# Aerolnea con menor cantidad de vuelos

conteo_por_origen = data_final.groupby("name_x")["name_y"].count().sort_values()

origen_conteo_minimo = conteo_por_origen.index[0]

conteo_minimo = conteo_por_origen.iloc[0]

fila_conteo_minimo = data_final[data_final["name_x"] == origen_conteo_minimo].iloc[0]

print(f"Origen con el conteo mnimo: {origen_conteo_minimo}")
print(f"Conteo mnimo: {conteo_minimo}")

Origen con el conteo mnimo: SkyWest Airlines Inc.
Conteo mnimo: 32

In [23]:
column_names = data_final.columns
column_names

Index(['carrier', 'name_x', 'year_x', 'month', 'day', 'dep_time',
       'sched_dep_time', 'dep_delay', 'arr_time', 'sched_arr_time',
       'arr_delay', 'flight', 'tailnum', 'origin', 'dest', 'air_time',
       'distance', 'hour', 'minute', 'time_hour_x', 'faa', 'name_y', 'lat',
       'lon', 'alt', 'tz', 'dst', 'tzone', 'year_y', 'type', 'manufacturer',
       'model', 'engines', 'seats', 'speed', 'engine', 'year', 'temp', 'dewp',
       'humid', 'wind_dir', 'wind_speed', 'wind_gust', 'precip', 'pressure',
       'visib', 'time_hour_y'],
      dtype='object')

In [24]:
# Calcula las medidas estadsticas para la columna "distance"
estadisticas_distancia = data_final["distance"].describe(include="all")

# Agrega una nueva columna llamada "tailnum" al resumen estadstico
estadisticas_distancia["tailnum"] = data_final["tailnum"]

# Muestra el resumen estadstico con la columna "tailnum" agregada
print(estadisticas_distancia.to_string())

count                                               334264.0
mean                                             1042.389967
std                                                733.37058
min                                                     80.0
25%                                                    502.0
50%                                                    872.0
75%                                                   1389.0
max                                                   4983.0
tailnum    0         N915XJ
1         N3GEAA
2         N5...

In [26]:
num_rows, num_cols = data_final.shape

print("Nmero de filas:", num_rows)
print("Nmero de columnas:", num_cols)

Nmero de filas: 334264
Nmero de columnas: 47

In [27]:
categoricas = data_final.select_dtypes(include=['object', 'string'])
print("Variables categricas:")
print(categoricas)

Variables categricas:
       carrier                       name_x dep_time dep_delay arr_time  \
0           9E            Endeavor Air Inc.      810         0     1048
1           AA       American Airlines Inc.      803        -7      903
2           AA       American Airlines Inc.      840        -5     1311
3           AA       American Airlines Inc.      909        59     1331
4           B6              JetBlue Airways      805         0     1015
...        ...                          ...      ...       ...      ...
334259      FL  AirTran Airways Corporation     2035         5     2158
334260      FL  AirTran Airways Corporation     2026        -4     2144
334261      FL  AirTran Airways Corporation     2020       -10     2131
334262      FL  AirTran Airways Corporation     2023        -7     2134
334263      UA        United Air Lines Inc.      524        -6      837

       arr_delay tailnum origin dest air_time  ... dst             tzone  \
0             11  N915XJ    JFK  MSP      189  ...   A  America/New_York
1            -22  N3GEAA    JFK  BOS       38  ...   A  America/New_York
2            -39  N5FSAA    JFK  SJU      188  ...   A  America/New_York
3             16  N5EXAA    JFK  STT      184  ...   A  America/New_York
4             10  N273JB    JFK  CLT       98  ...   A  America/New_York
...          ...     ...    ...  ...      ...  ...  ..               ...
334259        -3  N929AT    LGA  CAK       64  ...   A  America/New_York
334260       -17  N957AT    LGA  CAK       64  ...   A  America/New_York
334261       -30  N906AT    LGA  CAK       57  ...   A  America/New_York
334262       -27  N968AT    LGA  CAK       59  ...   A  America/New_York
334263         6  N17627    LGA  IAH      214  ...   A  America/New_York

       year_y                     type    manufacturer            model speed  \
0        2007  Fixed wing multi engine  BOMBARDIER INC      CL-600-2D24  None
1        None                     None            None             None  None
2        None                     None            None             None  None
3        None                     None            None             None  None
4        2007  Fixed wing multi engine         EMBRAER  ERJ 190-100 IGW  None
...       ...                      ...             ...              ...   ...
334259   2000  Fixed wing multi engine          BOEING          717-200  None
334260   2000  Fixed wing multi engine          BOEING          717-200  None
334261   2001  Fixed wing multi engine          BOEING          717-200  None
334262   2001  Fixed wing multi engine          BOEING          717-200  None
334263   None                     None            None             None  None

           engine wind_gust           time_hour_y
0       Turbo-fan      None  2013-01-01T13:00:00Z
1            None      None  2013-01-01T13:00:00Z
2            None      None  2013-01-01T13:00:00Z
3            None      None  2013-01-01T13:00:00Z
4       Turbo-fan      None  2013-01-01T13:00:00Z
...           ...       ...                   ...
334259  Turbo-fan      None                     0
334260  Turbo-fan      None                     0
334261  Turbo-fan      None                     0
334262  Turbo-fan      None                     0
334263       None      None  2013-01-09T10:00:00Z

[334264 rows x 23 columns]